Revit 2026 API

# DirectShapeTypeAppendShape(IListGeometryObject) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AppendShape(
	IList<GeometryObject> pGeomArr
)
```
```vb
Public Sub AppendShape (
	pGeomArr As IList(Of GeometryObject)
)
```
```cpp
public:
void AppendShape(
	IList<GeometryObject^>^ pGeomArr
)
```
```fsharp
member AppendShape :
        pGeomArr : IList<GeometryObject> -> unit
```

#### Parameters

pGeomArr IListGeometryObject

#### Reference

DirectShapeType Class

AppendShape Overload

Autodesk.Revit.DB Namespace